:PROPERTIES:
:ID:       69f25a70-c039-488f-9382-91b998b7c0f5
:END:
#+title: Guix System Configuration

* System Configuration
  [[https://guix.gnu.org/manual/en/html_node/Using-the-Configuration-System.html][System Configuration]]
  #+BEGIN_SRC bash :results output
  guix system describe
  #+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
Generation 3	Oct 17 2021 15:49:49	(current)
  file name: /var/guix/profiles/system-3-link
  canonical file name: /gnu/store/fglmbrfnhs68cqymi7a3wdhiwki7h82a-system
  label: GNU with Linux-Libre 5.14.12
  bootloader: grub-efi
  root device: UUID: 67ce5d9c-7af1-4435-a2a9-68651ab9a281
  kernel: /gnu/store/kv0qyiiii50lipga5fgzl1jw3158ah83-linux-libre-5.14.12/bzImage
  channels:
    nonguix:
      repository URL: https://gitlab.com/nonguix/nonguix.git
      branch: master
      commit: 3246eac4fe6d7cab88ea21d9de902caf4aa6e522
    giuliano108-guix-packages:
      repository URL: https://github.com/giuliano108/guix-packages
      branch: master
      commit: 5bb057baf290455b11ab4a748e15c8293d086146
    guix:
      repository URL: https://git.savannah.gnu.org/git/guix.git
      branch: master
      commit: 64e58296530df8cf7a106fa5797789bc8daf1243
  configuration file: /gnu/store/3xs6hd3ydv951ydbp603nw907qrx25m0-configuration.scm
#+END_EXAMPLE
** Services
   One-shot services stop immediately after their start action has completed.

*** term-auto
   - Q: What's the term-auto service? It seems to be my only stopped service
   - A1: "term-auto" is mainly for serial consoles that might need a log-in
     prompt. The regular (VT) ttys use mingetty instead. It's basically always
     stopped - that it could be presented in a less misleading way.
     See [[https://logs.guix.gnu.org/guix/2020-09-23.log#174932][IRC #guix channel log]]
   - A2: There is no ‘term-auto’ service (it's similar to a systemd term@auto
     instance). See [[https://logs.guix.gnu.org/guix/2020-03-23.log#213842][IRC #guix channel log]]

* Time Machine
  Provides access to other Guix revisions. Run commands from a different
  revision / older version.
